/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 串口1地址自动识别举例举例---------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg52.h"
#include "intrins.h"

typedef unsigned char BYTE;
typedef unsigned int WORD;

//-----------------------------------------------

#define     ACKTST  0x78            //从机1应答测试数据
unsigned char dat;

sbit p10=P1^0;
sbit p11=P1^1;

void InitUart();

char count;

void main()
{
    InitUart();                     //初始化串口
    ES = 1;
    EA = 1;
    while (1);
}

/*----------------------------
UART 中断服务程序
-----------------------------*/
void Uart() interrupt 4 using 1
{
 /*
	if (TI)
    {
        TI = 0;                     //清除TI位
        if (count != 0)
        {
            count--;
            SBUF = dat;          //继续发送应答数据
        }
    }
*/
    if (RI)
    {
        RI = 0;                     //清除RI位
        count = 1;
        dat = SBUF;              //并开发送应答数据
		//P1 = dat;
		switch (dat)
		{
			case 0xfe:p10=0;break;
			case 0xfd:p11=0;break;
			case 0x01:p10=1;break;
			case 0x02:p11=1;break;
			case 0xff:P1=0xff;break;
		 	
		}
		TI = 1;
    }
}

/*----------------------------
初始化串口
----------------------------*/
void InitUart()
{
    TMOD = 0x20;                //设置定时器1为8位自动重装载模式
	SCON = 0x50;
	PCON = 0x00;
	
  //  AUXR = 0x40;                //定时器1为1T模式
    TH1 = 0xfd;
	TL1 = 0xfd;           //115200 bps(256 - 18432000/32/115200)
    TR1 = 1;
}

